CSI API ETABS v1

# eHingeLocationType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eHingeLocationType

    Public Enumeration eHingeLocationType

    Dim instance As eHingeLocationType

    public enum class eHingeLocationType

    type eHingeLocationType

Members

| Member name| Value| Description
---|---|---|---
| RelativeDistance| 1|
| OffsetFromIEnd| 2|
| OffsetFromJEnd| 3|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com